sysbench/output_64/cacheline64/oltp-ro.out
sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 454.60 qps: 7276.35 (r/w/o: 6366.95/0.00/909.39) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 455.03 qps: 7279.53 (r/w/o: 6369.47/0.00/910.07) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 447.59 qps: 7162.50 (r/w/o: 6267.32/0.00/895.19) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 452.41 qps: 7237.97 (r/w/o: 6333.15/0.00/904.82) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 450.79 qps: 7213.19 (r/w/o: 6311.62/0.00/901.57) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 454.81 qps: 7274.30 (r/w/o: 6364.69/0.00/909.61) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 452.80 qps: 7247.08 (r/w/o: 6341.47/0.00/905.61) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 453.80 qps: 7258.64 (r/w/o: 6351.04/0.00/907.61) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 452.60 qps: 7243.97 (r/w/o: 6338.77/0.00/905.20) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 454.99 qps: 7279.61 (r/w/o: 6369.64/0.00/909.98) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 454.21 qps: 7265.15 (r/w/o: 6356.73/0.00/908.42) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            380926
        write:                           0
        other:                           54418
        total:                           435344
    transactions:                        27209  (453.47 per sec.)
    queries:                             435344 (7255.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      453.4667
    time elapsed:                        60.0022s
    total number of events:              27209

Latency (ms):
         min:                                    1.66
         avg:                                    2.20
         max:                                    9.39
         95th percentile:                        2.43
         sum:                                59949.22

Threads fairness:
    events (avg/stddev):           27209.0000/0.00
    execution time (avg/stddev):   59.9492/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 2 tps: 910.38 qps: 14569.65 (r/w/o: 12748.49/0.00/1821.16) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 2 tps: 913.88 qps: 14622.40 (r/w/o: 12794.65/0.00/1827.75) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 2 tps: 909.93 qps: 14556.50 (r/w/o: 12736.64/0.00/1819.86) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 884.46 qps: 14155.01 (r/w/o: 12386.09/0.00/1768.93) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 2 tps: 909.59 qps: 14553.69 (r/w/o: 12734.50/0.00/1819.19) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 901.01 qps: 14413.89 (r/w/o: 12611.88/0.00/1802.01) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 2 tps: 908.00 qps: 14527.67 (r/w/o: 12711.67/0.00/1816.01) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 913.38 qps: 14613.15 (r/w/o: 12786.38/0.00/1826.77) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 2 tps: 914.41 qps: 14632.99 (r/w/o: 12804.17/0.00/1828.82) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 916.00 qps: 14657.02 (r/w/o: 12825.02/0.00/1832.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 2 tps: 913.00 qps: 14607.03 (r/w/o: 12781.02/0.00/1826.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            763280
        write:                           0
        other:                           109040
        total:                           872320
    transactions:                        54520  (908.59 per sec.)
    queries:                             872320 (14537.48 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      908.5926
    time elapsed:                        60.0049s
    total number of events:              54520

Latency (ms):
         min:                                    1.64
         avg:                                    2.20
         max:                                   12.78
         95th percentile:                        2.43
         sum:                               119907.04

Threads fairness:
    events (avg/stddev):           27260.0000/68.00
    execution time (avg/stddev):   59.9535/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 1384.80 qps: 22160.27 (r/w/o: 19389.86/0.00/2770.41) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 1391.14 qps: 22262.78 (r/w/o: 19480.51/0.00/2782.27) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 1392.75 qps: 22285.97 (r/w/o: 19500.47/0.00/2785.50) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 1229.59 qps: 19673.63 (r/w/o: 17214.45/0.00/2459.18) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 1424.22 qps: 22784.90 (r/w/o: 19936.46/0.00/2848.44) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 1583.20 qps: 25332.48 (r/w/o: 22166.07/0.00/3166.41) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 1654.53 qps: 26473.53 (r/w/o: 23164.46/0.00/3309.07) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 1772.47 qps: 28360.77 (r/w/o: 24815.82/0.00/3544.95) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 1440.80 qps: 23051.23 (r/w/o: 20169.63/0.00/2881.60) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 1587.59 qps: 25396.00 (r/w/o: 22220.82/0.00/3175.17) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 1494.61 qps: 23917.77 (r/w/o: 20928.55/0.00/2989.22) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 1525.00 qps: 24398.84 (r/w/o: 21348.84/0.00/3050.01) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1251740
        write:                           0
        other:                           178820
        total:                           1430560
    transactions:                        89410  (1490.03 per sec.)
    queries:                             1430560 (23840.55 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1490.0342
    time elapsed:                        60.0053s
    total number of events:              89410

Latency (ms):
         min:                                    1.80
         avg:                                    2.68
         max:                                   53.48
         95th percentile:                        3.89
         sum:                               239791.31

Threads fairness:
    events (avg/stddev):           22352.5000/131.97
    execution time (avg/stddev):   59.9478/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 1652.78 qps: 26457.41 (r/w/o: 23150.46/0.00/3306.95) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 1642.62 qps: 26280.75 (r/w/o: 22995.31/0.00/3285.44) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 1687.20 qps: 26995.79 (r/w/o: 23621.39/0.00/3374.40) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1623.23 qps: 25976.53 (r/w/o: 22730.07/0.00/3246.47) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 1404.93 qps: 22479.15 (r/w/o: 19669.28/0.00/2809.87) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 1522.41 qps: 24350.28 (r/w/o: 21305.47/0.00/3044.81) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 1587.81 qps: 25407.89 (r/w/o: 22232.48/0.00/3175.41) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1695.20 qps: 27128.17 (r/w/o: 23737.57/0.00/3390.60) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 1619.40 qps: 25906.83 (r/w/o: 22668.03/0.00/3238.80) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1623.02 qps: 25970.71 (r/w/o: 22724.67/0.00/3246.04) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 1671.00 qps: 26736.60 (r/w/o: 23394.60/0.00/3342.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1636.40 qps: 26178.81 (r/w/o: 22906.41/0.00/3272.40) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1355760
        write:                           0
        other:                           193680
        total:                           1549440
    transactions:                        96840  (1613.84 per sec.)
    queries:                             1549440 (25821.52 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1613.8447
    time elapsed:                        60.0058s
    total number of events:              96840

Latency (ms):
         min:                                    2.10
         avg:                                    4.95
         max:                                   72.08
         95th percentile:                        6.79
         sum:                               479768.10

Threads fairness:
    events (avg/stddev):           12105.0000/262.67
    execution time (avg/stddev):   59.9710/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 16 tps: 1617.98 qps: 25922.43 (r/w/o: 22683.28/0.00/3239.16) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 1633.63 qps: 26141.64 (r/w/o: 22874.39/0.00/3267.26) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 1608.60 qps: 25735.41 (r/w/o: 22518.21/0.00/3217.20) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1624.59 qps: 25996.91 (r/w/o: 22747.72/0.00/3249.19) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 1362.79 qps: 21796.60 (r/w/o: 19071.03/0.00/2725.58) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 1558.62 qps: 24940.06 (r/w/o: 21822.83/0.00/3117.23) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 16 tps: 1586.60 qps: 25386.06 (r/w/o: 22212.85/0.00/3173.21) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1597.00 qps: 25551.12 (r/w/o: 22357.13/0.00/3193.99) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 16 tps: 1600.60 qps: 25604.66 (r/w/o: 22403.65/0.00/3201.01) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1642.40 qps: 26282.20 (r/w/o: 22997.20/0.00/3285.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 16 tps: 1624.37 qps: 25989.67 (r/w/o: 22741.14/0.00/3248.53) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 1641.43 qps: 26255.04 (r/w/o: 22973.38/0.00/3281.65) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1337154
        write:                           0
        other:                           191022
        total:                           1528176
    transactions:                        95511  (1591.60 per sec.)
    queries:                             1528176 (25465.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1591.5957
    time elapsed:                        60.0096s
    total number of events:              95511

Latency (ms):
         min:                                    2.16
         avg:                                   10.05
         max:                                  104.14
         95th percentile:                       12.75
         sum:                               959736.54

Threads fairness:
    events (avg/stddev):           5969.4375/106.64
    execution time (avg/stddev):   59.9835/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 32 tps: 1668.37 qps: 26754.70 (r/w/o: 23411.58/0.00/3343.12) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 32 tps: 1670.20 qps: 26730.41 (r/w/o: 23390.21/0.00/3340.20) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 32 tps: 1648.19 qps: 26366.70 (r/w/o: 23070.32/0.00/3296.39) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 1666.01 qps: 26658.37 (r/w/o: 23326.15/0.00/3332.22) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 32 tps: 1615.16 qps: 25843.51 (r/w/o: 22613.40/0.00/3230.11) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 1317.44 qps: 21079.05 (r/w/o: 18443.97/0.00/2635.08) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 32 tps: 1600.40 qps: 25606.78 (r/w/o: 22406.18/0.00/3200.60) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 1620.60 qps: 25928.14 (r/w/o: 22686.75/0.00/3241.39) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 32 tps: 1616.80 qps: 25871.16 (r/w/o: 22637.56/0.00/3233.59) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 1633.21 qps: 26128.09 (r/w/o: 22861.88/0.00/3266.21) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 32 tps: 1622.00 qps: 25951.40 (r/w/o: 22707.40/0.00/3244.00) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 1642.78 qps: 26254.28 (r/w/o: 22972.12/0.00/3282.16) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1353016
        write:                           0
        other:                           193288
        total:                           1546304
    transactions:                        96644  (1610.15 per sec.)
    queries:                             1546304 (25762.37 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1610.1482
    time elapsed:                        60.0218s
    total number of events:              96644

Latency (ms):
         min:                                    1.86
         avg:                                   19.87
         max:                                  174.91
         95th percentile:                       38.94
         sum:                              1919892.81

Threads fairness:
    events (avg/stddev):           3020.1250/77.83
    execution time (avg/stddev):   59.9967/0.01